In [104]:
import pandas as pd

1. Pandas Series. Why is it better than our list?

- Pandas Series is a one-dimensional labeled array of values
- each column in a DataFrame is a Series

major differences between Pandas Series and Python list:
- loops are required to operate on list elements (one by one), while operations can be performed on the entire series at once
- lists allow position based indexing only, series additionally have labeled indexing
- pandas provide ways to easily find and handle missing data

2. Creating/ Reading dataframes: Creating dataframe with different methods. (list, dictionary, tuple, array etc). Reading from csv and other file formats with different kinds of separators.

In [105]:
# creating empty df
df = pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [106]:
# list
data = [[1, 2], [3, 4]]
df_list = pd.DataFrame(data, columns=['A', 'B'])
df_list

   A  B
0  1  2
1  3  4

In [107]:
# dictionary
data = {'letter': ['w','x','y','z'], 'number': [1, 2, 3, 4]}
df_dict = pd.DataFrame(data)
df_dict

  letter  number
0      w       1
1      x       2
2      y       3
3      z       4

In [108]:
# tuple
data = (('a','b'), (11, 22, 33))
df_tuple = pd.DataFrame(data)
df_tuple

    0   1     2
0   a   b   NaN
1  11  22  33.0

In [109]:
# numpy array
import numpy as np
data = np.array([['jerry', 58], ['rob', 25], ['emma', 30]])
df_array = pd.DataFrame(data, columns=['name', 'age'])
df_array

    name age
0  jerry  58
1    rob  25
2   emma  30

In [110]:
# list of dictionaries
data = [{'a': 1, 'b': 2, 'c': 3},
        {'a': 10, 'b': 20, 'c': 30}]
df_listofdict = pd.DataFrame(data, index=['first', 'second'])
df_listofdict

         a   b   c
first    1   2   3
second  10  20  30

In [111]:
# reading from file (csv)
df_csv = pd.read_csv('datasets/task_2/fortune1000.csv')
print(df_csv.head())

              Company  Revenues  Profits  Employees       Sector  \
0             Walmart  500343.0   9862.0    2300000    Retailing
1         Exxon Mobil  244363.0  19710.0      71200       Energy
2  Berkshire Hathaway  242137.0  44940.0     377000   Financials
3               Apple  229234.0  48351.0     123000   Technology
4  UnitedHealth Group  201159.0  10558.0     260000  Health Care

                                   Industry
0                     General Merchandisers
1                        Petroleum Refining
2  Insurance: Property and Casualty (Stock)
3               Computers, Office Equipment
4   Health Care: Insurance and Managed Care

3. Dataframe slicing

In [112]:
sliced_rows = df_csv.loc[16:18]
print(sliced_rows)
print()

sliced_columns = df_csv.loc[:, 'Profits':'Sector']
print(sliced_columns.head())

                     Company  Revenues  Profits  Employees  \
16                    Kroger  122662.0   1907.0     449000
17          General Electric  122274.0  -5786.0     313000
18  Walgreens Boots Alliance  118214.0   4078.0     290000

                 Sector              Industry
16  Food &  Drug Stores  Food and Drug Stores
17          Industrials  Industrial Machinery
18  Food &  Drug Stores  Food and Drug Stores

   Profits  Employees       Sector
0   9862.0    2300000    Retailing
1  19710.0      71200       Energy
2  44940.0     377000   Financials
3  48351.0     123000   Technology
4  10558.0     260000  Health Care

4. Type casting and Type conversion in pandas.

In [113]:
# type casting
print("Before: ", df_csv['Employees'].dtype)
df_csv['Employees'] = df_csv['Employees'].astype(float)
print("After type casting: ", df_csv['Employees'].dtype)

# type conversion
df_csv['Employees'] = df_csv['Employees'].apply(int)
print("After type conversion: ", df_csv['Employees'].dtype)

Before:  int64
After type casting:  float64
After type conversion:  int64

5. Find and drop duplicates from the csv file attached.

In [114]:
print(df_csv.duplicated().sum())

7

In [115]:
df_csv = df_csv.drop_duplicates()
print(df_csv.duplicated().sum())

0

6. Creating a new column.

In [116]:
data = {'Name': ['A', 'B', 'C', 'D', 'E'],
        'Age': [25, 32, 18, 47, 33]}
df = pd.DataFrame(data)
print(df)

  Name  Age
0    A   25
1    B   32
2    C   18
3    D   47
4    E   33

In [117]:
df['Gender'] = ['F', 'M', 'M', 'F', 'F']
print(df)

  Name  Age Gender
0    A   25      F
1    B   32      M
2    C   18      M
3    D   47      F
4    E   33      F

In [118]:
df = df.assign(Address = ['KTM', 'BKT', 'PKR', 'BKT', 'KTM'])
df

  Name  Age Gender Address
0    A   25      F     KTM
1    B   32      M     BKT
2    C   18      M     PKR
3    D   47      F     BKT
4    E   33      F     KTM

In [119]:
df['AgeGroup'] = df['Age'].apply(lambda x: 'Young' if x < 30 else 'Old')
print(df)

  Name  Age Gender Address AgeGroup
0    A   25      F     KTM    Young
1    B   32      M     BKT      Old
2    C   18      M     PKR    Young
3    D   47      F     BKT      Old
4    E   33      F     KTM      Old

7. Summary functions

In [120]:
df_csv['Profits'].mean()

np.float64(1111.7725450901803)

In [121]:
df_csv[['Profits', 'Employees']].median()

Profits        321.05
Employees    12799.50
dtype: float64

In [122]:
df_csv['Employees'].std()

91461.794252002

In [123]:
df_csv['Sector'].unique()

array(['Retailing', 'Energy', 'Financials', 'Technology', 'Health Care',
       'Wholesalers', 'Telecommunications', 'Motor Vehicles & Parts',
       'Food &  Drug Stores', 'Industrials', 'Aerospace & Defense',
       'Household Products', 'Transportation',
       'Food, Beverages & Tobacco', 'Chemicals', 'Media', 'Apparel',
       'Materials', 'Hotels, Restaurants & Leisure', 'Business Services',
       'Engineering & Construction'], dtype=object)

In [124]:

df_csv['Sector'].value_counts()

Sector
Financials                       155
Energy                           107
Technology                       103
Retailing                         77
Health Care                       71
Business Services                 53
Industrials                       49
Materials                         45
Wholesalers                       44
Transportation                    40
Food, Beverages & Tobacco         37
Chemicals                         33
Household Products                28
Engineering & Construction        27
Hotels, Restaurants & Leisure     26
Media                             25
Aerospace & Defense               25
Motor Vehicles & Parts            19
Apparel                           14
Food &  Drug Stores               12
Telecommunications                10
Name: count, dtype: int64

In [125]:
df_csv.groupby("Sector")["Revenues"].mean()

Sector
Aerospace & Defense              15353.400000
Apparel                           7225.521429
Business Services                 5963.962264
Chemicals                         7610.636364
Energy                           14425.300935
Engineering & Construction        6399.333333
Financials                       15757.935484
Food &  Drug Stores              33789.000000
Food, Beverages & Tobacco        13790.054054
Health Care                      21239.315493
Hotels, Restaurants & Leisure     6916.346154
Household Products                8277.850000
Industrials                      10615.102041
Materials                         6184.400000
Media                             9219.496000
Motor Vehicles & Parts           22817.631579
Retailing                        21874.714286
Technology                       13347.789320
Telecommunications               46695.900000
Transportation                   11379.000000
Wholesalers                      20185.204545
Name: Revenues, dtype: float64

In [126]:
df_csv.Revenues.describe()

count      1000.000000
mean      14378.202400
std       30835.849087
min        1848.000000
25%        2886.500000
50%        5417.000000
75%       12108.750000
max      500343.000000
Name: Revenues, dtype: float64

8. Pandas `apply()` function.

In [127]:
df_csv[['Profits','Sector']].head()

   Profits       Sector
0   9862.0    Retailing
1  19710.0       Energy
2  44940.0   Financials
3  48351.0   Technology
4  10558.0  Health Care

In [128]:
def apply_function(x):
    return x + " Sector"

df_csv['Sector'].apply(apply_function).head()

0      Retailing Sector
1         Energy Sector
2     Financials Sector
3     Technology Sector
4    Health Care Sector
Name: Sector, dtype: object

In [129]:
df_csv['Profits'].apply(lambda num : num * 10).head()

0     98620.0
1    197100.0
2    449400.0
3    483510.0
4    105580.0
Name: Profits, dtype: float64

In [130]:
df = pd.DataFrame({'A': [1, 2], 'B': [10, 20]})

df1 = df.apply(np.sum, axis=0)
print(df1)

df1 = df.apply(np.sum, axis=1)
print(df1)

A     3
B    30
dtype: int64
0    11
1    22
dtype: int64